tutorials/BalmforthKerswell_01_muIv/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.granul 0
);

regions
(
    boxToCell
    {
        box (-0.1 -0.1 -0.1) (0.06 0.2 0.2);
        fieldValues
        (
            volScalarFieldValue alpha.granul 1
        );
    }
);


// ************************************************************************* //
